app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Music of Earth"], ["body", "A nice play to play Guitar.\r\nBody of music."], ["updated_at", "2020-04-24 14:15:14.855202"], ["id", 12]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(article_params)