app/controllers/authors_controller.rb

SELECT COUNT(*) FROM "authors"
---
  def zero_authors_or_authenticated
    (redirect_to root_path) if Author.count.zero? || current_user
    false if Author.count.zero? || current_user

INSERT INTO "authors" ("username", "email", "crypted_password", "salt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save